{
  "title": "Work Experience",
  "list": [
    {
      "name": "Orka Labs Inc.",
      "position": "Software Development Intern (Full-stack)",
      "startDate": "2023.07",
      "endDate": "Present",
      "description": "Maintained key functionalities of the official Orka official website v2; Refactored legacy codes; Managed Amazon Web Services; Optimized website load time.",
      "projects": [
        {
          "title": {
            "text": "Orka Official Website",
            "githubLink": null,
            "otherLink": "https://www.hiorka.com/"
          },
          "description": "Responsibilities included maintaining the official Orka website, refactoring code, and managing AWS services.",
          "startDate": "2023.07",
          "endDate": "Present",

          "which": [
            "Maintained Key Functionalities: Ensured the stability of the official Orka website (v2), including the Hearing Aids Blog and Support Center pages, successfully resolving over 50 bugs and issues.",
            "Code Refactoring: Overhauled over 2400 lines of disorganized legacy code, implemented ESLint files and husky script for automated code inspections before code commit.",
            "Website Optimization: Managed Amazon Web Services (AWS) for website deployment and databases, such as optimized image responsiveness, enhancing website efficiency by reducing load time by 10%.",
            "AI in Customer Service: Single-handedly managed implementation of a GPT-3.5 turbo fine-tuned Customer Service Bot across the entire tech stack. Responsibilities included automatic dataset formation from a Lark workspace, OpenAI fine-tuning and embedding forming & matching, setting up a Django backend API server and Database on AWS, and developing a Next.js frontend interface."
          ],
          "techStack": [
            "Next.js",
            "React.js",
            "Django",
            "Material UI(MUI)",
            "AWS (S2, Cloudfront, EC2, Lambda)",
            "postgreSQL",
            "Git"
          ]
        }
      ]
    },
    {
      "name": "Yonyou Software Co., Ltd.",
      "position": "Software Development Intern (Front-end)",
      "startDate": "2022.06",
      "endDate": "2022.08",
      "description": "Migrated and integrated CPAS 5.2 features into CPAS 6.0; Independently completed core project functionalities.",
      "projects": [
        {
          "title": {
            "text": "CPAS 6.0",
            "githubLink": null,
            "otherLink": null
          },
          "description": "Participated in the development of CPAS 6.0, successfully identifying and rectifying logic bugs; Facilitated the migration of specific CPAS 5.2 functions to the CPAS 6.0 framework.",
          "startDate": "2022.06",
          "endDate": "2022.08",
          "which": [
            "Migrated and integrated over 25 CPAS 5.2 powerful features into the new CPAS 6.0 system",
            "Independently completed core project functionalities including mini-programs (e.g., OCR/ASR recognition)"
          ],
          "techStack": ["React.js", "DevExpress", "Ant Design", "umi.js", "Git"]
        }
      ]
    }
  ]
}
